cask_args appdir: "/Applications"

# AWS Tooling
brew "awscli"

# CLI Productivity Tools
brew "autojump"
brew "cowsay"
brew "fzf"
brew "graphviz"
brew "htop"
brew "hub"
brew "jid"
brew "jq"
brew "mas"
brew "plantuml"
brew "powerline-go"
brew "pstree"
brew "pv"
brew "reattach-to-user-namespace"
brew "restic"
brew "ssh-copy-id"
brew "the_silver_searcher"
brew "tmux"
brew "youtube-dl"
brew "zsh"

# Dev Tools
brew "dos2unix"
brew "git"
brew "gnupg"
brew "kubernetes-cli"
brew "neovim"
brew "tig"
brew "vim"

# Admin Tools
brew "gnu-sed"
brew "telnet"
brew "tree"
brew "watch"
brew "webp"
brew "wget"
brew "wireshark"
brew "xz"

# Programming Languages
brew "asdf"

# Dev Libraries
brew "libxml2"
brew "libyaml"

# --------------
# Homebrew Casks
# --------------

# Applications
cask "google-chrome"
cask "firefox"
cask "licecap"
cask "vlc"

# Dev Tools
cask "docker"
cask "iterm2"
cask "macvim"
cask "vagrant"
cask "visual-studio-code"

# Productivity Tools
cask "alfred"
cask "anybar"
cask "notion"
cask "postman"
cask "spectacle"
cask "tomighty"

# Fonts
tap "homebrew/cask-fonts"
cask "font-fira-code"
cask "font-source-code-pro"

# ------------------
# Mac Store Installs
# ------------------
mas '1Password 7 - Password Manager', id: 1333542190
mas 'Blackmagic Disk Speed Test', id: 425264550
mas 'ColorSnapper', id: 418176775
mas 'DaisyDisk', id: 411643860
mas 'Day One', id: 1055511498
mas 'Deckset', id: 847496013
mas 'Keynote', id: 409183694
mas 'Tweetbot 2 For Twitter', id: 557168941
mas 'Twitter', id: 409789998